<?php
return [
    'accepted' => 'يجب قبول الحقل {:attr}.',
    'after' => 'يجب أن يكون {:attr} تاريخًا بعد {:param0}.',
    'after_equal' => 'يجب أن يكون {:attr} تاريخًا بعد أو يساوي {:param0}.',
    'alpha' => 'يجب أن يحتوي الحقل {:attr} على أحرف فقط.',
    'alpha_dash' => 'قد يحتوي الحقل {:attr} فقط على أحرف وأرقام وشرطات وشرطات سفلية.',
    'alpha_num' => 'قد يحتوي الحقل {:attr} فقط على أحرف وأرقام.',
    'alpha_space' => 'قد يحتوي الحقل {:attr} فقط على أحرف ومسافات.',
    'array' => 'يجب أن يكون الحقل {:attr} مصفوفة.',
    'before'=> 'يجب أن يكون الحقل {:attr} تاريخًا قبل {:param0}.',
    'before_equal' => 'يجب أن يكون {:attr} تاريخًا قبل أو يساوي {:param0}.',
    'boolean' => 'يمكن أن يكون الحقل {:attr} صحيحًا أو خاطئًا فقط.',
    'date' => 'يجب أن يكون الحقل {:attr} تاريخًا صالحًا.',
    'email' => 'يجب أن يكون الحقل {:attr} عنوان بريد إلكتروني صالح.',
    'extensions' => 'يجب أن يكون للحقل {:attr} واحدة من الامتدادات التالية: {:params}',
    'file' => 'يجب أن يكون الحقل {:attr} ملفًا.' ,
    'image' => 'يجب أن يكون {:attr} صورة.',
    'integer' => 'يجب أن يكون الحقل {:attr} عددًا صحيحًا.',
    'ip' => 'يجب أن يكون الحقل {:attr} عنوان IP صالح',
    'length' => [
        'countable' => 'يجب أن يحتوي الحقل {:attr} على {:param0} عناصر.',
        'digits' => 'يجب أن يكون الحقل {:attr} {:param0} رقمًا.',
        'string' => 'يجب أن يكون الحقل {:attr} {:param0} حرفًا.',       
    ],
    'max_length' => [
        'countable' => 'يجب ألا يحتوي الحقل {:attr} على أكثر من {:param0} عناصر.',
        'digits' => 'يجب ألا يحتوي الحقل {:attr} على أكثر من {:param0} أرقام.',
        'string' => 'يجب أن يكون الحقل {:attr} بطول {:param0} حرفًا على الأكثر.'
    ],
    'max' => [
        'file' => 'يجب ألا يزيد الحقل {:attr} عن {:param0} .',
        'numeric' => 'يجب ألا يزيد الحقل {:attr} عن {:param0}',
    ],
    'mimes' => 'يجب أن يكون الحقل {:attr} ملفًا من النوع: {:params}',
    'mime_types' => 'يجب أن يكون الحقل {:attr} ملفًا من النوع: :{:params}',
    'min_length' => [
        'countable' => 'يجب أن يحتوي الحقل {:attr} على الأقل {:param0} عناصر.',
        'digits' => 'يجب أن يحتوي الحقل {:attr} على الأقل {:param0} أرقام.',
        'string' => 'يجب أن يكون الحقل {:attr} {:param0} حرفًا على الأقل.'
    ],
    'min' => [
        'file' => 'يجب أن يكون الحقل {:attr} {:param0}  على الأقل.',
        'numeric' => 'يجب أن يكون الحقل {:attr} {:param0} على الأقل.',
    ],
    'numeric' => 'يجب أن يكون {:attr} رقمًا.',
    'present' => 'يجب أن يكون الحقل {:attr} موجودًا.',
    'required' => 'الحقل {:attr} مطلوب.',
    'size' => [
        'file' => 'يجب أن يكون الحقل {:attr} {:param0} .',
        'numeric' => 'يجب أن يكون الحقل {:attr} {:param0}.',
    ],
    'string' => 'يجب أن يكون الحقل {:attr} سلسلة.',
    'url' => 'يجب أن يكون الحقل {:attr} URL صالح.'
];