<?php
return [
    'accepted' => 'فیلد {:attr} باید پذیرفته شود.',
    'after' => '{:attr} باید تاریخی بعد از {:param0} باشد.',
    'after_equal' => '{:attr} باید تاریخی بعد یا مساوی با {:param0} باشد.',
    'alpha' => 'فیلد {:attr} باید فقط شامل حروف باشد.',
    'alpha_dash' => 'فیلد {:attr} می‌تواند فقط شامل حروف، اعداد، خط فاصله و زیرخط باشد.',
    'alpha_num' => 'فیلد {:attr} می‌تواند فقط شامل حروف و اعداد باشد.',
    'alpha_space' => 'فیلد {:attr} می‌تواند فقط شامل حروف و فاصله باشد.',
    'array' => 'فیلد {:attr} باید یک آرایه باشد.',
    'before'=> 'فیلد {:attr} باید تاریخی قبل از {:param0} باشد.',
    'before_equal' => '{:attr} باید تاریخی قبل یا مساوی با {:param0} باشد.',
    'boolean' => 'فیلد {:attr} فقط می‌تواند درست یا نادرست باشد.',
    'date' => 'فیلد {:attr} باید یک تاریخ معتبر باشد.',
    'email' => 'فیلد {:attr} باید یک آدرس ایمیل معتبر باشد.',
    'extensions' => 'فیلد {:attr} باید یکی از پسوندهای زیر را داشته باشد: {:params}',
    'file' => 'فیلد {:attr} باید یک فایل باشد.' ,
    'image' => '{:attr} باید یک تصویر باشد.',
    'integer' => 'فیلد {:attr} باید یک عدد صحیح باشد.',
    'ip' => 'فیلد {:attr} باید یک آدرس IP معتبر باشد',
    'length' => [
        'countable' => 'فیلد {:attr} باید شامل {:param0} مورد باشد.',
        'digits' => 'فیلد {:attr} باید {:param0} رقم باشد.',
        'string' => 'فیلد {:attr} باید {:param0} کاراکتر باشد.',       
    ],
    'max_length' => [
        'countable' => 'فیلد {:attr} نباید بیش از {:param0} مورد داشته باشد.',
        'digits' => 'فیلد {:attr} نباید بیش از {:param0} رقم داشته باشد.',
        'string' => 'فیلد {:attr} باید حداکثر {:param0} کاراکتر باشد.'
    ],
    'max' => [
        'file' => 'فیلد {:attr} نباید بیشتر از {:param0}  باشد.',
        'numeric' => 'فیلد {:attr} نباید بیشتر از {:param0} باشد',
    ],
    'mimes' => 'فیلد {:attr} باید یک فایل از نوع: {:params} باشد',
    'mime_types' => 'فیلد {:attr} باید یک فایل از نوع: :{:params} باشد',
    'min_length' => [
        'countable' => 'فیلد {:attr} باید حداقل {:param0} مورد داشته باشد.',
        'digits' => 'فیلد {:attr} باید حداقل {:param0} رقم داشته باشد.',
        'string' => 'فیلد {:attr} باید حداقل {:param0} کاراکتر باشد.'
    ],
    'min' => [
        'file' => 'فیلد {:attr} باید حداقل {:param0}  باشد.',
        'numeric' => 'فیلد {:attr} باید حداقل {:param0} باشد.',
    ],
    'numeric' => '{:attr} باید یک عدد باشد.',
    'present' => 'فیلد {:attr} باید حضور داشته باشد.',
    'required' => 'فیلد {:attr} مورد نیاز است.',
    'size' => [
        'file' => 'فیلد {:attr} باید {:param0}  باشد.',
        'numeric' => 'فیلد {:attr} باید {:param0} باشد.',
    ],
    'string' => 'فیلد {:attr} باید یک رشته باشد.',
    'unique' => 'فیلد {:attr}  می بایست یکتا باشد.',
    'url' => 'فیلد {:attr} باید یک URL معتبر باشد.'
];